{
  "backend/main.mo": "Empty Motoko canister actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping implemented photography site features to corresponding source files and components.",
  "frontend-file-summaries.txt": "Lists short summaries of all frontend source files for build and documentation purposes.",
  "frontend/index.css": "Tailwind base styles with extensive OKLCH variable definitions for light and dark themes.",
  "frontend/index.html": "HTML entry point defining metadata, fonts, and mounting root for the React app.",
  "frontend/src/App.tsx": "Main React component assembling navigation, all site sections, and the footer.",
  "frontend/src/components/Footer.tsx": "Footer component with brand info, navigation shortcuts, contact details, and social links.",
  "frontend/src/components/LightboxModal.tsx": "Lightbox modal component for displaying enlarged portfolio images using shadcn dialog.",
  "frontend/src/components/NavBar.tsx": "Responsive navbar with scroll-to-section behavior, mobile menu, and style changes on scroll.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an About section with studio description, highlight cards, and a grid of specialties.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact form with validation, submission handling, and a success message state.",
  "frontend/src/components/sections/HomeSection.tsx": "Provides the hero section with background image, headline, and buttons that scroll to portfolio or contact sections.",
  "frontend/src/components/sections/PackagesSection.tsx": "Displays photography package details using an accordion, including coverage, deliverables, turnaround, and add-ons.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Shows a filterable portfolio grid with category buttons and a lightbox modal for viewing images.",
  "frontend/src/components/sections/PricingSection.tsx": "Lists pricing tiers in cards with features and a button that scrolls to the contact section.",
  "frontend/src/content/packages.ts": "Defines package details and exports an array of photography packages with pricing, deliverables, and terms.",
  "frontend/src/content/portfolio.ts": "Defines portfolio categories, item type, and a list of 12 sample portfolio entries with image paths and titles.",
  "frontend/src/content/pricing.ts": "Defines pricing tier structure and three tiers with descriptions, prices, and inclusion lists.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInquiryForm.ts": "Implements local inquiry form state, validation, submission simulation via sessionStorage, and reset logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, managing auth client creation, login, stored identities, and status flags.",
  "frontend/src/index.css": "Tailwind base/styles defining color variables, typography, dark mode, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Stores project metadata, requirements, and image specifications for the photography website."
}