{
  "backend/main.mo": "Motoko canister that stores inquiries and user profiles with admin-protected CRUD and role-based authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of autogenerated summaries describing the purpose of various frontend files in the project.",
  "frontend/.env": "Environment config setting VITE_SITE_NAME for development.",
  "frontend/.env.production": "Environment config setting VITE_SITE_NAME for production builds.",
  "frontend/index.css": "Global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point defining metadata, fonts, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main React component that switches between the public site and the office admin page based on URL hash.",
  "frontend/src/components/Footer.tsx": "Footer component showing branding, contact details, and an Instagram link.",
  "frontend/src/components/LightboxModal.tsx": "Modal component displaying a large image with title and category, closable via UI or Escape key.",
  "frontend/src/components/NavBar.tsx": "Responsive navigation bar with scroll-based styling, section scrolling, and a mobile menu.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an about section with company description, highlight cards, and a list of specialties. Uses mapped UI components and icons for structured presentation.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact section with static contact details and an inquiry form powered by a custom hook. Handles submission state, validation errors, and success UI.",
  "frontend/src/components/sections/HomeSection.tsx": "Displays a hero section with background imagery, marketing text, and buttons that smooth-scroll to other sections. Includes a scroll indicator and responsive layout.",
  "frontend/src/components/sections/PackagesSection.tsx": "Shows an accordion listing photography packages with coverage, deliverables, turnaround, and optional add-ons. Pulls structured data from packagesData.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Provides a filterable portfolio grid with category selection and a lightbox modal for viewing images. Filters items based on selected category.",
  "frontend/src/components/sections/PricingSection.tsx": "Displays pricing tiers in card layout with features, pricing, and a button that scrolls to the contact section. Supports highlighting a featured tier.",
  "frontend/src/content/packages.ts": "Exports package definitions containing pricing, coverage, deliverables, add-ons, and terms. Used to populate package details in the UI.",
  "frontend/src/content/portfolio.ts": "Defines portfolio item types and exports an array of categorized portfolio images.",
  "frontend/src/content/pricing.ts": "Defines pricing tier structure and exports three photography package configurations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInquiryForm.ts": "Manages inquiry form state, validation, submission, and reset logic using a saveInquiry mutation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for inquiries, user profiles, and authorization using the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables and typography settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/OfficeInquiriesPage.tsx": "Admin page handling login, profile setup, inquiry listing, deletion, and message parsing.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing), storing them in sessionStorage, and retrieving or clearing persisted values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, shadows, animations, and container settings with plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current requirements and constraints for a minimal photography website, including pages, branding updates, inquiry form behavior, and admin-area expectations."
}