{
  "backend/main.mo": "Minimal Motoko actor with no functions or state.",
  "feature_evidence.json": "Feature evidence report detailing implemented UI changes and the files involved.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of all frontend files.",
  "frontend/.env": "Development environment file setting VITE_SITE_NAME to vows-site.",
  "frontend/.env.production": "Production environment file setting VITE_SITE_NAME to vows-site.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining light and dark theme tokens.",
  "frontend/index.html": "HTML entry point with site metadata, fonts, and React root mount point.",
  "frontend/src/App.tsx": "Main React app rendering NavBar, Home, About, Contact sections, and Footer.",
  "frontend/src/components/Footer.tsx": "Simplified footer showing branding and a single Instagram link.",
  "frontend/src/components/LightboxModal.tsx": "Lightbox modal displaying an enlarged image with title and category.",
  "frontend/src/components/NavBar.tsx": "Responsive navigation bar with Home, About Us, and Get in Touch actions.",
  "frontend/src/components/sections/AboutSection.tsx": "About page section featuring background text, highlights grid, and specialties list.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders a contact form with validation, submission handling, and a success state using a custom inquiry form hook.",
  "frontend/src/components/sections/HomeSection.tsx": "Displays a hero section with background image, headline, and buttons that smooth-scroll to other sections.",
  "frontend/src/components/sections/PackagesSection.tsx": "Shows package details in an accordion layout, pulling data from packagesData and displaying coverage, deliverables, and add‑ons.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Provides a filterable image gallery with category selection and lightbox modal for viewing enlarged images.",
  "frontend/src/components/sections/PricingSection.tsx": "Lists pricing tiers in card layouts with features and a button that scrolls to the contact section.",
  "frontend/src/content/packages.ts": "Defines package data including pricing, coverage, deliverables, add‑ons, turnaround times, and terms.",
  "frontend/src/content/portfolio.ts": "Exports categorized portfolio items with image paths, titles, and categories.",
  "frontend/src/content/pricing.ts": "Provides pricing tier definitions with descriptions, inclusions, and featured tier flags.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using react-query and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInquiryForm.ts": "Manages inquiry form state, validation, submission simulation via sessionStorage, and exposes handlers for input and reset.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identity, login/clear actions, and status tracking for authentication.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom color variables, typography, and dark mode theme for the site.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, container settings, utilities, and plugins for animations and typography.",
  "project_state.json": "Stores project configuration, architectural notes, feature list, and state metadata for the photography website."
}