{
  "kind": "build_request",
  "title": "Update site-wide brand name, remove My Inquiries feature, and fix inquiry submission failure",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Replace the studio/brand name text \"The Stories By Vows\" with exactly \"The Stories Behind VOWS\" across the entire site UI (navigation brand label, footer brand label, About section heading/body copy, and any other user-facing occurrences).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Change The name in all the site The Stories Behind VOWS not The stories By vows"
        ]
      },
      "acceptanceCriteria": [
        "All visible instances of \"The Stories By Vows\" (case-insensitive variants included) are replaced with \"The Stories Behind VOWS\".",
        "NavBar brand button, Footer brand label, and About section heading render \"The Stories Behind VOWS\" on both desktop and mobile."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Remove the \"My Inquiries\" / \"Received Inquiries\" user experience from the public site: remove the \"My Inquiries\" navigation link, remove the \"View Sent Inquiries\" button shown after successful form submission, and remove/disable the #/received-inquiries route so it is no longer accessible from the public UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove my inquiries"
        ]
      },
      "acceptanceCriteria": [
        "The NavBar no longer displays a \"My Inquiries\" link/button in desktop or mobile menus.",
        "After a successful inquiry submission, the success state does not show any button/link that navigates to sent/received inquiries.",
        "Navigating to #/received-inquiries does not show the prior inquiries table page (it should instead show the normal public site or a simple not-found-style fallback within the existing app routing)."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Ensure the Booking/Inquiry form submission no longer fails with the error message \"Failed to submit inquiry. Please try again.\" under normal operation by preventing submission while the backend actor is still loading/unavailable and by providing a reliable successful submit path. Also clear any previously stored local inquiries and stop persisting new inquiries to localStorage.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "shown Failed to submit inquiry. Please try again."
        ]
      },
      "acceptanceCriteria": [
        "If the backend actor is not ready, the form submit action is blocked (e.g., disabled button) and does not produce the \"Failed to submit inquiry. Please try again.\" error.",
        "When the actor becomes available, submitting a valid inquiry results in the existing success UI state (\"Thank You! We've received your inquiry...\") without showing the failure alert.",
        "The localStorage key \"sent-inquiries\" is cleared (removing previously saved inquiries), and successful submissions no longer write inquiries to localStorage."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead).",
    "Backend is single-actor; keep all Motoko logic in backend/main.mo if backend changes become necessary (none requested here)."
  ],
  "nonGoals": [
    "Do not add a new admin/office inquiries view or any Internet Identity-gated admin route.",
    "Do not introduce email sending or any third-party integrations for inquiries."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}