{
  "kind": "build_request",
  "title": "Add private office/admin URL to view received inquiries and persist inquiries in backend",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Persist Booking/Inquiry form submissions in the Motoko backend so that inquiries can be received and viewed from an office/admin page (not just stored in the client browser).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Give me 2 url's one for clint to saw our wedsite and send inquiry's and second one is to our office to recive the inquiry's"
        ]
      },
      "acceptanceCriteria": [
        "Submitting the inquiry form creates a new inquiry record stored in the backend canister state (survives page reload and can be read from a different device/browser).",
        "The inquiry payload stored includes: name, email, event type, preferred date, message, and a created timestamp.",
        "The existing success state still appears after a successful submit.",
        "No email sending is added."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Create a separate office/admin page available at a second URL path (e.g., #/office) that lists all received inquiries in one place, and do not add any navigation/link to this page in the client-facing UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "But not to visible to clints and Give me 2 url's one for clint to saw our wedsite and send inquiry's and second one is to our office to recive the inquiry's"
        ]
      },
      "acceptanceCriteria": [
        "The client-facing website remains accessible at the normal/public URL (home page) and includes the inquiry form.",
        "A separate office/admin view is accessible via a distinct URL path (hash-based route is acceptable, e.g., <site-url>/#/office).",
        "There is no visible link/button in the NavBar, Home, About, Contact, or Footer that exposes the office/admin page to clients.",
        "The office/admin page displays a clear heading (English) such as \"Office Inquiries\" and renders a table/list of inquiries with at least: submitted time, name, email, event type, preferred date, and message."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Restrict the office/admin inquiries page so that it is not accessible to clients: require Internet Identity login and enforce backend authorization for listing inquiries.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "But not to visible to clints"
        ]
      },
      "acceptanceCriteria": [
        "If the user is not logged in with Internet Identity, the office/admin page shows a login prompt and does not show inquiries.",
        "Backend endpoints that return inquiry lists reject unauthorized callers (not anonymous, and not in the configured allowlist).",
        "If an unauthorized user navigates directly to the office/admin URL, they cannot see inquiry data and receive a clear access-denied message in the UI (English)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Provide (in the UI copy on the office/admin page) the two URLs users need: one for clients (public site) and one for the office/admin inquiries page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Give me 2 url's one for clint to saw our wedsite and send inquiry's and second one is to our office to recive the inquiry's"
        ]
      },
      "acceptanceCriteria": [
        "The office/admin page includes a small section that shows the public site URL and the office/admin URL (derived from window.location / current origin, not hard-coded).",
        "The displayed URLs are in English labels such as \"Client website\" and \"Office inquiries\"."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if required for upgrading existing stable state.",
    "Do not edit any frontend files under frontend/src/components/ui or the immutable hook/bootstrap paths listed in SYSTEM_CONTEXT.",
    "Do not add third-party authentication (only Internet Identity)."
  ],
  "nonGoals": [
    "Do not add email sending or SMS notifications for inquiries.",
    "Do not create a separate deployment/canister/domain for the office/admin area; it should be a separate URL path within the same site.",
    "Do not re-add removed public sections (Portfolio, Pricing, Packages)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}