{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Office/admin hash route to view backend-persisted inquiries with Internet Identity protection",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Update inquiry form submission to persist inquiries via backend canister (not localStorage) while keeping the existing success UI.",
      "acceptanceCriteria": [
        "Submitting the inquiry form creates a new inquiry record stored in the backend canister state (survives page reload and can be read from a different device/browser).",
        "The inquiry payload stored includes: name, email, event type, preferred date, message, and a created timestamp.",
        "The existing success state still appears after a successful submit.",
        "No email sending is added."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInquiryForm.ts",
          "operation": "modify",
          "description": "Replace the localStorage-based submission with a backend call using the actor from the core-infrastructure (via existing useActor hook) to persist inquiries; ensure the submit flow still sets isSuccess on success and surfaces a clear error on failure. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "modify",
          "description": "Ensure the inquiry form passes eventType and preferred date into the hook submit payload and continues to show the existing success state after a successful backend persistence; do not add any email-sending UI or logic. Use existing shadcn-ui form primitives already imported (Button/Input/Select/Alert) to keep the UI consistent. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add a separate office/admin inquiries view at a distinct hash route (e.g., #/office) with no client-visible navigation entry.",
      "acceptanceCriteria": [
        "The client-facing website remains accessible at the normal/public URL (home page) and includes the inquiry form.",
        "A separate office/admin view is accessible via a distinct URL path (hash-based route is acceptable, e.g., <site-url>/#/office).",
        "There is no visible link/button in the NavBar, Home, About, Contact, or Footer that exposes the office/admin page to clients.",
        "The office/admin page displays a clear heading (English) such as \"Office Inquiries\" and renders a table/list of inquiries with at least: submitted time, name, email, event type, preferred date, and message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OfficeInquiriesPage.tsx",
          "operation": "create",
          "description": "Create the Office Inquiries page UI with an English heading (e.g., \"Office Inquiries\") and a table/list rendering inquiry fields (submitted time, name, email, event type, preferred date, message) pulled from the backend actor; include loading and empty states. Use shadcn-ui components where available (e.g., Button, Alert) without modifying frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire a minimal hash-based route switch so that the default/public app renders as-is, and navigating to #/office renders the new OfficeInquiriesPage; do not add any NavBar/Home/About/Contact/Footer links to the office route. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Gate the office/admin inquiries view behind Internet Identity login and show access-denied UI for non-admin/unauthorized users.",
      "acceptanceCriteria": [
        "If the user is not logged in with Internet Identity, the office/admin page shows a login prompt and does not show inquiries.",
        "Backend endpoints that return inquiry lists reject unauthorized callers (not anonymous, and not in the configured allowlist).",
        "If an unauthorized user navigates directly to the office/admin URL, they cannot see inquiry data and receive a clear access-denied message in the UI (English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OfficeInquiriesPage.tsx",
          "operation": "modify",
          "description": "Add Internet Identity gating using the existing useInternetIdentity hook: if not authenticated, render a login prompt (and no inquiry data). Once authenticated, check admin authorization via the backend actor (e.g., isCallerAdmin/getCallerUserRole) before attempting to render inquiry list; if unauthorized or the backend rejects, show an English access-denied message and do not display any inquiry data. Use shadcn-ui Button/Alert for consistent prompts and messaging. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Ensure actor-dependent query invalidation/clearing behavior is compatible with office/admin auth transitions (login/logout) so cached inquiry data is not shown after logout; rely on React Query cache clearing patterns already used in the app. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Show the two required URLs (client site and office inquiries) on the office/admin page, derived from the current origin.",
      "acceptanceCriteria": [
        "The office/admin page includes a small section that shows the public site URL and the office/admin URL (derived from window.location / current origin, not hard-coded).",
        "The displayed URLs are in English labels such as \"Client website\" and \"Office inquiries\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OfficeInquiriesPage.tsx",
          "operation": "modify",
          "description": "Add an office page section that displays English-labeled URLs derived from window.location (origin for \"Client website\" and origin + '/#/office' for \"Office inquiries\"), without hard-coding deployment-specific values. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}