{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rebrand site text, remove My Inquiries UX, and harden inquiry submission",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Replace all user-visible brand name occurrences with exactly \"The Stories Behind VOWS\" across the public UI.",
      "acceptanceCriteria": [
        "All visible instances of \"The Stories By Vows\" (case-insensitive variants included) are replaced with \"The Stories Behind VOWS\".",
        "NavBar brand button, Footer brand label, and About section heading render \"The Stories Behind VOWS\" on both desktop and mobile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/NavBar.tsx",
          "operation": "modify",
          "description": "Update the brand label text in the NavBar from \"The Stories By Vows\" to exactly \"The Stories Behind VOWS\"."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update the footer brand label text from \"The Stories By Vows\" to exactly \"The Stories Behind VOWS\"."
        },
        {
          "path": "frontend/src/components/sections/AboutSection.tsx",
          "operation": "modify",
          "description": "Update the About section heading and body copy to replace \"The Stories By Vows\" with exactly \"The Stories Behind VOWS\"."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the document <title> and meta description to replace \"The Stories By Vows\" with exactly \"The Stories Behind VOWS\" so browser UI reflects the new brand."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Remove the public \"My Inquiries\" / \"Received Inquiries\" experience, including navigation, post-submit link, and the #/received-inquiries route behavior.",
      "acceptanceCriteria": [
        "The NavBar no longer displays a \"My Inquiries\" link/button in desktop or mobile menus.",
        "After a successful inquiry submission, the success state does not show any button/link that navigates to sent/received inquiries.",
        "Navigating to #/received-inquiries does not show the prior inquiries table page (it should instead show the normal public site or a simple not-found-style fallback within the existing app routing)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/NavBar.tsx",
          "operation": "modify",
          "description": "Remove the \"My Inquiries\" nav item and any related navigation handler so it is no longer shown on desktop or mobile."
        },
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "modify",
          "description": "Remove the \"View Sent Inquiries\" button and any logic that navigates to #/received-inquiries from the success state."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove routing that renders the ReceivedInquiriesPage for #/received-inquiries and ensure that hash instead falls back to the normal public site (or a minimal in-app not-found-style fallback) without exposing the prior inquiries table."
        },
        {
          "path": "frontend/src/pages/ReceivedInquiriesPage.tsx",
          "operation": "delete",
          "description": "Delete the ReceivedInquiriesPage implementation so the prior inquiries table page cannot be rendered by the public app."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Prevent inquiry submission when the backend actor is unavailable, ensure successful submission path, and stop using localStorage for inquiries (including clearing existing stored inquiries).",
      "acceptanceCriteria": [
        "If the backend actor is not ready, the form submit action is blocked (e.g., disabled button) and does not produce the \"Failed to submit inquiry. Please try again.\" error.",
        "When the actor becomes available, submitting a valid inquiry results in the existing success UI state (\"Thank You! We've received your inquiry...\") without showing the failure alert.",
        "The localStorage key \"sent-inquiries\" is cleared (removing previously saved inquiries), and successful submissions no longer write inquiries to localStorage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInquiryForm.ts",
          "operation": "modify",
          "description": "Stop persisting inquiries to localStorage (remove the save-to-localStorage behavior), clear the existing \"sent-inquiries\" key on initialization, and add actor-readiness awareness (via useActor) so submission can be blocked before attempting backend calls."
        },
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "modify",
          "description": "Disable/guard the submit action when the backend actor is not ready (so submit cannot run and does not show the failure alert), while preserving the existing success UI for valid submissions when actor is available."
        }
      ]
    }
  ]
}